"""
1. Можно привести пример с парфюмом. Так, от класса-родителя Perfume можно унаследовать класс Florar Perfume, но по факту, цветочный парфюм - это просто парфюм,
обладающий цветочными нотами. То есть, в том же родительском классе Perfume можно просто добавить поле type = FloralNotes.

2. Автомобиль и электромобиль. От класса-родителя Automobile() можно унаследовать класс Electromobile(). По сути же, электромобиль - это тот же автомобиль,
который обладает другим типом двигателя, поэтому в исходном классе Automobile() мы можем указать электромобиль с помощью поля engine = Electromotor().
"""
